regtests/0140_testxml/test.out

Pimg : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<awsns:Test xmlns:awsns="http://soapaws/">
<Workorder xsi:type="Workorder">
   <Woid xsi:type="xsd:string">Wo1</Woid>
   <Orderline soapenc:arrayType="awsns:Orderline[1]" xsi:type="soapenc:Array">
      <Orderline xsi:type="Orderline">
         <Woid xsi:type="xsd:string"></Woid>
         <Produced xsi:type="xsd:int">0</Produced>
      </Orderline>
   </Orderline>
</Workorder>
</awsns:Test>
</soapenv:Body>
</soapenv:Envelope>
